# Задача 10: На столе лежат n монеток. 
# Некоторые из них лежат вверх решкой, а некоторые – 
# гербом. Определите минимальное число монеток, 
# которые нужно перевернуть, чтобы все монетки были повернуты вверх 
# одной и той же стороной. Выведите минимальное количество монет, 
# которые нужно перевернуть
import random


coins = int(input('введите количество монет '))
z = 0
r = 0
coin = [0, 1]
for i in range(coins):
    random.shuffle(coin)
    print(f'все монеты{coin}')
    if int(coin[0]) == 0:
        z += 1
    else:
        r += 1
if r > z:
    ans = z
else:
    ans = r
print(f'минимальное количество монет, которые надо перевернуть {ans}')

