# Задача 16: Требуется вычислить, сколько раз встречается некоторое число X в массиве A[1..N]. 
# Пользователь в первой строке вводит натуральное число N – количество элементов в массиве. 
# последующих  строках записаны N целых чисел Ai. Последняя строка содержит число X
# *Пример:*
# 5
#     1 2 3 4 5
#     3
#     -> 1
n = int(input('Введите количество элементов: '))
lst = []
for i in range(n):
     num = int(input('введите целое число: '))
     lst.append(num)
print(lst)

k = int(input('Введите число, которое нужно найти в списке: '))
count = 0
for i in range(n):
    if k == lst[i]:
        count+=1
print(f' Число {k} встречается в списке {count} раз')