# Задача 18: Требуется найти в массиве A[1..N] самый близкий по величине элемент к заданному числу X. 
# Пользователь в первой строке вводит натуральное число N – количество элементов в массиве. 
# В последующих  строках записаны N целых чисел Ai. Последняя строка содержит число X

n = int(input('Введите количество элементов: '))
# lst = [i for i in range(1, n+1)]
lst = []
for i in range(n):
     num = int(input('введите целое число: '))
     lst.append(num)
print(lst)

z = int(input('Введите число, которое нужно сравнить: '))
num = 0
a = z- lst[0]
for i in range(1, n):
    b = z- lst[i]
    if b < a and b > 0:
        a = b
        num = i
print(f' Ближайшим числом к {z} является {lst[num]}')
      
