# Задача 4: Петя, Катя и Сережа делают из бумаги журавликов. 
# Вместе они сделали S журавликов. Сколько журавликов сделал каждый ребенок, если известно, 
# что Петя и Сережа сделали одинаковое количество журавликов, а Катя сделала в два раза больше журавликов, 
# чем Петя и Сережа вместе?
# *Пример:*
# 6 -> 1  4  1
# 24 -> 4  16  4
#     60 -> 10  40  10

g = int(input('Введите количество сделанных журавликов '))
# kat = (pet + ser)*2
# pet = ser
# g = ser + ser + (2ser*2) = 6 ser
ser = g / 6
kat = ser * 4
print(f'Сережа и Петя сделали по {ser} единиц, а Катя сделала {kat} журавликов')

